EVALUATE a ALSO b ALSO TRUE
	WHEN 1 ALSO 1 THRU 9 ALSO c  EQUAL 1 PERFORM all-life
	WHEN 2 ALSO 1 THRU 9 ALSO c EQUAL 2 PERFORM life
	WHEN 3 THRU 9 ALSO 1 ALSO c EQUAL 9 PERFORM disability
	WHEN OTHER PERFORM INVALID
	
END-EVALUATE.
		
	