
WRITE record-buff

WRITE INDEXED-RECORD
	WITH LOCK
	ON INVALID KEY
		DISPLAY "Key exists, REWRITING..." END-DISPLAY
		PERFORM REWRITE-KEY
END-WRITE
IF INDEXED-FILE-STATUS NOT EQUAL ZERO THEN
	DISPLAY "Write problem: "INDEXED-FILE-STATUS UPON SYSERR
	END-DISPLAY
	PERFORM evasive-manoeuvres
END-IF

WRITE record-name-1 AFTER ADVANCING PAGE

WRITE record-name-1 FROM header-record-1
	AFTER ADVANCING 2 LINES
	AT END-OF-PAGE
		PERFORM write-page-header
		PERFORM write-last-detail-reminder
END-WRITE
