
IF A = 1 OR 2 ...

IF A = 1 OR A = 2 ...

*********************************************************************************

IF A = 1 OR 2 THEN
perform miracles
END-IF
IF A = 1 OR 2 AND B = 1 THEN
perform rites-of-passage
ELSE
perform song-and-dance
END-IF